
/*
Створіть ієрархію, що складається з наступних класів:
"побутовий прилад", "праска", "телевізор", "холодильник".
Самостійно провести об'єктно-оріентований аналіз, створити
відповідні UML-діаграми, та написати відповідний код. Базовий клас
ієрархії повинен бути реалізований, як абстрактний. Решта створених
класів мусять мати відповідні конструктори, get- та set-методи, та
інші атрибути, що відповідають результатам об'єктно-орієнтованого
аналізу.
Також класи ієрархії повинні мати метод, що демонструє
перемикання пристрою у різних ситуаціях.
Тестовий клас повинен мати масив посилань на об'єкти
базового класу ієрархії, ініціалізовані випадковими об'єктами, а
також код, що демонструє ключові можливості розроблених класів,
включно із методом для перемикання пристрою.
*/
public class Main {
    public static void main(String[] args) {
        HouseholdAppliance[] appliance = new HouseholdAppliance[3];
        appliance[0] = new SmoothingIron();
        appliance[1] = new TV();
        appliance[2] = new Refrigerator();

        //Перемикання з включеним побутовим приладом
        for (int i = 0; i < appliance.length; i++) {
            appliance[i].enable();
            appliance[i].switching();
            appliance[i].turnOff();
            System.out.println();
        }

        //Перемикання з вимкненим побутовим приладом
        for (int i = 0; i < appliance.length; i++) {
            appliance[i].switching();
            appliance[i].turnOff();
            System.out.println();
        }
    }
}